In [4]:
#dataframe
import pandas as pd
import numpy as np

# 데이터 프레임 객체 생성
- 리스트 안에 딕셔너리로 생성 : 
    - '[{},{},{}]' : "{column : value, ... } >row
- 딕셔너리 안에 리스트로 생성 :
    - '{column1:[values], column2:[values]}' > column

In [2]:
# 리스트의 딕셔너리

In [5]:
datas = [
    {"name":"data","email":"data@gmail.com","id":1},
    {"name":"python","email":"python@naver.com","id":2}
]

In [20]:
df = pd.DataFrame(datas)
df

      name              email  id
0     data     data@gmail.com   1
1   python   python@naver.com   2
2  jupyter  jupyter@daume.net   3

In [3]:
# 딕셔너리의 리스트

In [9]:

datas = df.to_dict("list")
datas

{'name': ['data', 'python'],
 'email': ['data@gmail.com', 'python@naver.com'],
 'id': [1, 2]}

In [10]:
df2 = pd.DataFrame(datas)

In [11]:
df2

     name             email  id
0    data    data@gmail.com   1
1  python  python@naver.com   2

In [19]:
datas = {'name': ['data', 'python','jupyter'],
 'email': ['data@gmail.com', 'python@naver.com','jupyter@daume.net'],
 'id': [1, 2, 3]}

In [13]:
#데이터 프레임의 변수 확인 : index, values, columns

In [22]:
df.index, df.columns, df.values

(RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'email', 'id'], dtype='object'),
 array([['data', 'data@gmail.com', 1],
        ['python', 'python@naver.com', 2],
        ['jupyter', 'jupyter@daume.net', 3]], dtype=object))

In [24]:
df.dtypes
#object는 문자열이라고 생각하면 됨

name     object
email    object
id        int64
dtype: object

# 데이터의 선택, 수정, 추가, 삭제

###  데이터 선택 : row만 선택하기, column만 선택하기, [row,column] 모두 선택하기

In [32]:
df

      name              email  id
0     data     data@gmail.com   1
1   python   python@naver.com   2
2  jupyter  jupyter@daume.net   3

In [36]:
#row만 선택하기
df.index = [0,1,2]
df.loc[::-1]

      name              email  id
2  jupyter  jupyter@daume.net   3
1   python   python@naver.com   2
0     data     data@gmail.com   1

In [37]:
df.loc[[0,2]]

      name              email  id
0     data     data@gmail.com   1
2  jupyter  jupyter@daume.net   3

In [38]:
#column만 선택하기
df['name']

0       data
1     python
2    jupyter
Name: name, dtype: object

In [41]:
df[['id','name','email']] #순서를 원하는대로 적어서 원하는대로 출력이 가능하다

   id     name              email
0   1     data     data@gmail.com
1   2   python   python@naver.com
2   3  jupyter  jupyter@daume.net

In [42]:
#row 와 column 동시에 선택하기

In [44]:
df.loc[::2,["id","email"]]

   id              email
0   1     data@gmail.com
2   3  jupyter@daume.net

## 데이터 수정 : 데이터선택 = 수정하는 데이터

In [45]:
df["id"]

0    1
1    2
2    3
Name: id, dtype: int64

In [46]:
df["id"] = 10

In [48]:
df['id']= [4,5,6]

In [49]:
df

      name              email  id
0     data     data@gmail.com   4
1   python   python@naver.com   5
2  jupyter  jupyter@daume.net   6

In [50]:
df.loc[1:,["name","id"]] = [["notebook",7],["macbook",8]]

In [51]:
df

       name              email  id
0      data     data@gmail.com   4
1  notebook   python@naver.com   7
2   macbook  jupyter@daume.net   8

In [52]:
#데이터 추가 : column 과 row 추가 모두 가능

In [56]:
#row 추가
df.loc[3] = ["iphone","iphone@daum.net",9]
df.loc[len(df)] = ["iphone","iphone@daum.net",9]

In [57]:
df

       name              email  id
0      data     data@gmail.com   4
1  notebook   python@naver.com   7
2   macbook  jupyter@daume.net   8
3    iphone    iphone@daum.net   9
4    iphone    iphone@daum.net   9

In [63]:
#column
df

       name              email  id
0      data     data@gmail.com   4
1  notebook   python@naver.com   7
2   macbook  jupyter@daume.net   8
3    iphone    iphone@daum.net   9
4    iphone    iphone@daum.net   9

In [70]:
df["addr"] = ["seoul","busan","incheon","anyang","incheon"]

In [71]:
df

       name              email  id     addr
0      data     data@gmail.com   4    seoul
1  notebook   python@naver.com   7    busan
2   macbook  jupyter@daume.net   8  incheon
3    iphone    iphone@daum.net   9   anyang
4    iphone    iphone@daum.net   9  incheon

In [65]:
#데이터 삭제 : df.drop()

In [67]:
df.drop(index=[3])

       name              email  id
0      data     data@gmail.com   4
1  notebook   python@naver.com   7
2   macbook  jupyter@daume.net   8
4    iphone    iphone@daum.net   9

In [72]:
df["email"].apply()

TypeError: apply() missing 1 required positional argument: 'func'

In [74]:
def get_domain(email):
    return email.split("@")[1].split(".")[0]

In [76]:
df['domail'] = df["email"].apply(lambda email:email.split("@")[1].split(".")[0])

In [77]:
df

       name              email  id     addr domail
0      data     data@gmail.com   4    seoul  gmail
1  notebook   python@naver.com   7    busan  naver
2   macbook  jupyter@daume.net   8  incheon  daume
3    iphone    iphone@daum.net   9   anyang   daum
4    iphone    iphone@daum.net   9  incheon   daum

In [78]:
!ls datas

articles    makedata.py

In [ ]:
# %load datas/makedata.py

# 사람의 이름과 나이가 들어간 데이터를 만듭니다.
import random
import numpy as np

# 랜덤한 이름 출력하는 함수
def get_name():
    names = ["Adam", "Alan", "Alex", "Alvin", "Andrew",
             "Anthony", "Arnold", "Jin", "Billy", "Anchal"]
    return random.choice(names)

# 랜덤한 나이 출력
def get_age(start=20, end=40):
    return np.random.randint(start, end + 1)

# 랜덤하게 나이와 이름을 출력
def make_data(rows=10):
    datas = []
    for _ in range(rows):
        data = {"Age": get_age(), "Name": get_name()}
        datas.append(data)
    return datas

In [80]:
import datas.makedata as md

In [85]:
md.get_name(),md.get_age()

('Alan', 27)

In [87]:
datas = md.make_data(5)
df = pd.DataFrame(datas)
df

   Age    Name
0   26  Andrew
1   37   Billy
2   26   Billy
3   35    Alex
4   35   Alvin

In [88]:
#df. append(): 두개의 데이터 프레임을 합칠 때 사용

In [90]:
df1 = pd.DataFrame(md.make_data(5))
df2 = pd.DataFrame(md.make_data(5))

In [99]:
df3 = df1.append(df2)
df3.head()

   Age     Name
0   38  Anthony
1   38     Adam
2   25     Adam
3   38     Alan
4   21     Alex

In [106]:
df1.append(df2,ignore_index=True)

   Age     Name
0   38  Anthony
1   38     Adam
2   25     Adam
3   38     Alan
4   21     Alex
5   21  Anthony
6   36     Alex
7   28    Billy
8   20     Adam
9   39   Arnold

In [95]:
#df.reset_index()

In [104]:
df3.reset_index(drop=True,inplace=True)

In [105]:
df3

   index  Age     Name
0      0   38  Anthony
1      1   38     Adam
2      2   25     Adam
3      3   38     Alan
4      4   21     Alex
5      0   21  Anthony
6      1   36     Alex
7      2   28    Billy
8      3   20     Adam
9      4   39   Arnold

In [107]:
#pd.concat() : row나 column으로 데이터를 합쳐줄때 사용

In [111]:
df3 = pd.concat([df1,df2])

In [112]:
df3

   Age     Name
0   38  Anthony
1   38     Adam
2   25     Adam
3   38     Alan
4   21     Alex
0   21  Anthony
1   36     Alex
2   28    Billy
3   20     Adam
4   39   Arnold

In [115]:
pd.concat([df3,df1]).reset_index(drop=True)

    Age     Name
0    38  Anthony
1    38     Adam
2    25     Adam
3    38     Alan
4    21     Alex
5    21  Anthony
6    36     Alex
7    28    Billy
8    20     Adam
9    39   Arnold
10   38  Anthony
11   38     Adam
12   25     Adam
13   38     Alan
14   21     Alex

In [116]:
df = pd.DataFrame(md.make_data())

In [117]:
df.tail(2)

   Age  Name
8   39  Alex
9   22   Jin

In [119]:
df

   Age     Name
0   38    Billy
1   34    Billy
2   27   Andrew
3   22      Jin
4   28     Alan
5   22  Anthony
6   38     Alan
7   22   Andrew
8   39     Alex
9   22      Jin

In [120]:
df.groupby("Name").size()

Name
Alan       2
Alex       1
Andrew     2
Anthony    1
Billy      2
Jin        2
dtype: int64

In [125]:
df.groupby("Name").agg("mean").reset_index()

      Name   Age
0     Alan  33.0
1     Alex  39.0
2   Andrew  24.5
3  Anthony  22.0
4    Billy  36.0
5      Jin  22.0